In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('data/data-tim-09.csv')
df

,BOROUGH,NEIGHBORHOOD,TAX CLASS AT PRESENT,RESIDENTIAL UNITS,COMMERCIAL UNITS,TOTAL UNITS,LAND SQUARE FEET,GROSS SQUARE FEET,YEAR BUILT,TAX CLASS AT TIME OF SALE,SALE PRICE,SALE DATE
0,Manhattan,ALPHABET CITY,2A,5,0,5,1633,6440,1900,2,6625000,2016-09-01
1,Manhattan,ALPHABET CITY,2,28,3,31,4616,18690,1900,2,0,2016-09-01
2,Manhattan,ALPHABET CITY,2,16,1,17,2212,7803,1900,2,0,2016-09-01
3,Manhattan,ALPHABET CITY,2B,10,0,10,2272,6794,1913,2,3936272,2016-09-01
4,Manhattan,ALPHABET CITY,2A,6,0,6,2369,4615,1900,2,8000000,2016-09-01
...,...,...,...,...,...,...,...,...,...,...,...,...
84543,Staten Island,WOODROW,1,2,0,2,2400,2575,1998,1,450000,2017-08-31
84544,Staten Island,WOODROW,1,2,0,2,2498,2377,1998,1,550000,2017-08-31
84545,Staten Island,WOODROW,1,2,0,2,4000,1496,1925,1,460000,2017-08-31
84546,Staten Island,WOODROW,4,0,7,7,208033,64117,2001,4,11693337,2017-08-31
84547,Staten Island,WOODROW,4,0,1,1,10796,2400,2006,4,69300,2017-08-31

In [3]:
new_df = df.sample(n=2000)
new_df = new_df.replace({np.nan: None})
new_df

,BOROUGH,NEIGHBORHOOD,TAX CLASS AT PRESENT,RESIDENTIAL UNITS,COMMERCIAL UNITS,TOTAL UNITS,LAND SQUARE FEET,GROSS SQUARE FEET,YEAR BUILT,TAX CLASS AT TIME OF SALE,SALE PRICE,SALE DATE
51494,Queens,BAYSIDE,1A,1,0,1,0,0,1985,1,465000,2017-04-06
81558,Staten Island,PORT IVORY,1B,0,0,0,2625,0,0,1,0,2017-08-11
22730,Bronx,RIVERDALE,1,1,0,1,3337,2260,2016,1,790000,2016-12-06
25611,Brooklyn,BATH BEACH,4,0,0,1,0,0,0,4,1400000,2016-12-16
28167,Brooklyn,BENSONHURST,1,2,0,2,2383,1726,1950,1,0,2016-12-27
...,...,...,...,...,...,...,...,...,...,...,...,...
15390,Manhattan,UPPER WEST SIDE (59-79),2,0,0,0,0,0,1971,2,485000,2016-11-03
73138,Queens,SOUTH OZONE PARK,1,2,0,2,2100,1248,1920,1,560000,2017-07-06
46779,Brooklyn,SHEEPSHEAD BAY,None,0,0,0,0,0,0,4,0,2017-03-20
22316,Bronx,PARKCHESTER,2A,3,1,4,4725,3864,1927,2,725000,2016-12-03
43490,Brooklyn,OCEAN PARKWAY-NORTH,1,3,0,3,2700,4158,1930,1,1315000,2017-03-03

In [4]:
col = new_df.columns
print(col)
len(col)

Index(['BOROUGH', 'NEIGHBORHOOD', 'TAX CLASS AT PRESENT', 'RESIDENTIAL UNITS',
       'COMMERCIAL UNITS', 'TOTAL UNITS', 'LAND SQUARE FEET',
       'GROSS SQUARE FEET', 'YEAR BUILT', 'TAX CLASS AT TIME OF SALE',
       'SALE PRICE', 'SALE DATE'],
      dtype='object')

12

In [5]:
map_data = new_df.values

In [6]:
temp = []

In [7]:
for i in range(len(map_data)):
    item = {
        col[0]: map_data[i][0],
        col[1]: map_data[i][1],
        col[2]: map_data[i][2],
        col[3]: map_data[i][3],
        col[4]: map_data[i][4],
        col[5]: map_data[i][5],
        col[6]: map_data[i][6],
        col[7]: map_data[i][7],
        col[8]: map_data[i][8],
        col[9]: map_data[i][9],
        col[10]: map_data[i][10],
        col[11]: map_data[i][11],
        # col[12]: map_data[i][12],
        # col[13]: map_data[i][13],
        # col[14]: map_data[i][14],
        # col[15]: map_data[i][15],
        # col[16]: map_data[i][16],
        # col[17]: map_data[i][17],
        # col[18]: map_data[i][18],
        # col[19]: map_data[i][19],
        # col[20]: map_data[i][20],
        # col[21]: map_data[i][21],
    }
    temp.append(item)

In [8]:
import json

In [9]:
# Directly from the dictionary
with open('data/data-tim-09.json', 'w+') as outfile:
    json.dump(temp, outfile)